================== EDA Packages =================
1) Pandas        : Dataframe or data applications
2) numpy         : Numerical Pythong for math operations
3) mathplotlib   : For plots graphs
4) seaborn       : For plots graphs
5) Bokhe         : For plots
6) Plotly        : For plots


================== Machine Learning ================
7) Scikit learn (sklearn)   : ML models
8) Stats                    : Statistical models


================== Data Retrieval from SQL scrapping ================
9) Sqlite           : connect with database
10) Beautiful Soup  : scarp the data from websites (like reviews from amazon, google, etc.,)
11) Websocket       : scrapping


================== Deep Learning / Computer Vision =====================
12) Tensorflow      : Deep Learning - Developed by Google (you see TPU)
13) Keras           : Deep Learning models
14) OpenCV          : Image Operations
15) Pillow (PIL)    : Image Operations
16) Pytorch         : Developed by Facebook
17) Pretrained models : Developed by different organizations
         VGG16
         Mobilenet
         RESNET
         RCNN
         MASKRCNN
         FASTERCNN
         YOLO
         
================== Natural Language Process (NLP) =====================
18) NLTK            : Natural Language Process Tool Kit
19) Scipy           : 
20) Word2vec (how words will convert into vector representation) ;
21) Glove (how words will convert into vector representation) ;
22) Wordcloud  (just like mentee showing the words like a cloud)


=================== Hugging face (it is a company taken over by google) ======================
23) Transformers    : BERT models (Bidirectional Encoder Representations from Transformers)


=================== GenAI models ========================
24) OpenAI+Microsoft : GPT Models
25) Google           : Gemini
26) Amazon           : Q
27) Meta Facebook    : Meta
28) Apple            : Apple GPT

LLAMA
GEMMA
Dalle-E
T5

All are having differnt packages so we use the Langchain framework which emcompasses all the different GenAI models


=================== Langchain  ====================
29) LangChain       : Framework 


=================== Deployments ===================
30) Flash
31) Streamlit
32) Django

=================== MLOPS ========================
33) Mlflow
34) Kubeflow
35) Azure AI services : Azure packages
36) GCP : GCP packages

**Step-1**

**Create a Dataframe**

- We will create a dataframe using list
- we will create a dataframe using dictionary

In [2]:
import pandas as pd
d1 = pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [3]:
type(d1)

pandas.core.frame.DataFrame

**Step-2**

**Provide the data**

In [4]:
names = ['tarun','surender', 'mohith']
pd.DataFrame(names)

          0
0     tarun
1  surender
2    mohith

In [5]:
names = ['tarun','surender', 'mohith']
age = [20,21,22]
pd.DataFrame(zip(names,age))

          0   1
0     tarun  20
1  surender  21
2    mohith  22

In [6]:
names = ['tarun','surender', 'mohith']
age = [20,21,22]
city = ['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city))

          0   1        2
0     tarun  20      hyd
1  surender  21      blr
2    mohith  22  chennai

**Step-3**

**Provide the column names**

In [9]:
names = ['tarun','surender', 'mohith']
pd.DataFrame(names,columns=['Names'])

      Names
0     tarun
1  surender
2    mohith

In [10]:
names = ['tarun','surender', 'mohith']
age = [20,21,22]
pd.DataFrame(zip(names,age), columns=['Names', 'Age'])

      Names  Age
0     tarun   20
1  surender   21
2    mohith   22

In [11]:
names = ['tarun','surender', 'mohith']
age = [20,21,22]
city = ['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city), columns=['Names', 'Age', 'City'])

      Names  Age     City
0     tarun   20      hyd
1  surender   21      blr
2    mohith   22  chennai

**Step-4**

**Providing Index**

In [13]:
names = ['tarun','surender', 'mohith']
age = [20,21,22]
city = ['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city),index=['A','B','C'], columns=['Names', 'Age', 'City'])

      Names  Age     City
A     tarun   20      hyd
B  surender   21      blr
C    mohith   22  chennai

In [18]:
names = ['tarun','surender', 'mohith']
age = [20,21,22]
city = ['hyd','blr','chennai']
df = pd.DataFrame(zip(names,age),index=city, columns=['Names', 'Age'])
df

            Names  Age
hyd         tarun   20
blr      surender   21
chennai    mohith   22

In [ ]:
Step1: Create Dateframe
Step2: Provide the data
Step3: Provide the column names
Step4: Providing Index

**Step-5**

**Add a new column on existing data frame**

In [1]:
import pandas as pd

names = ['Ram','Shyam','Krishna']
age = [21,22,23]
city = ['Hyd', 'Blr', 'Chennai']
df = pd.DataFrame(zip(names,age,city), columns = ['Names','Age','City'])
df

     Names  Age     City
0      Ram   21      Hyd
1    Shyam   22      Blr
2  Krishna   23  Chennai

- If you want to add a new column first check how many rows are there
- For example in above dataframe we have 3 rows
- your new column also should have 3 rows
- Suppose I want to create a new column called **Salary**
- make a list with 3 values
- salary = [100000,200000,300000]

**Syntax** : dataframe[column] = list of values
- df['Salary'] = [100000,200000,300000]

In [2]:
df['Salary'] = [100000,200000,300000]
df

     Names  Age     City  Salary
0      Ram   21      Hyd  100000
1    Shyam   22      Blr  200000
2  Krishna   23  Chennai  300000

In [3]:
df['Gender'] = ['M','M']
df

ValueError: Length of values (2) does not match length of index (3)

In [4]:
df['Gender'] = ['M','M','']
df

     Names  Age     City  Salary Gender
0      Ram   21      Hyd  100000      M
1    Shyam   22      Blr  200000      M
2  Krishna   23  Chennai  300000

In [5]:
df['Gender'] = ['M','M','','']
df

ValueError: Length of values (4) does not match length of index (3)

In [6]:
df

     Names  Age     City  Salary Gender
0      Ram   21      Hyd  100000      M
1    Shyam   22      Blr  200000      M
2  Krishna   23  Chennai  300000

In [7]:
# Overrides the column values if given same column name
df['Salary'] = [400000,500000,600000]
df

     Names  Age     City  Salary Gender
0      Ram   21      Hyd  400000      M
1    Shyam   22      Blr  500000      M
2  Krishna   23  Chennai  600000

In [15]:
# Use case-1 
# Create a empty dataframe
# Create three list
# list1 = values from 1 to 10 using list comprehension
# list2 = square of 1 to 10
# list3 = cube of 1 to 10

import pandas as pd

list1 = [x for x in range(1,11)]
list2 = [x**2 for x in range(1,11)]
list3 = [x**3 for x in range(1,11)]

df['X'] = list1
df['X^2'] = list2
df['X^3'] = list3
df

    X  X^2   X^3
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

**Step-6**

**Update the already existing column in the data frame**

- Create a new column
    - Creating a new list
    - df[<new column>] = <list>
    - Create a new column the column name is our choice
- Update existing column are same way only
    - Here also we need to make a list of values = number of rows
    - df[<existing columns name>] = <update list>
    - While updating the existing columns, we need to provide the existing column name only

In [16]:
df

    X  X^2   X^3
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [17]:
df['X'] = [2*x for x in range(1,11)]
df

    X  X^2   X^3
0   2    1     1
1   4    4     8
2   6    9    27
3   8   16    64
4  10   25   125
5  12   36   216
6  14   49   343
7  16   64   512
8  18   81   729
9  20  100  1000

**Step-7**

**How to drop a column**

In [18]:
#how to check the columns
df.columns

Index(['X', 'X^2', 'X^3'], dtype='object')

- If you want to drop a specific column we will use drop method
- we already know about difference between keywords and methods
- keywords will use directly
- methods will use with corresponding dataframe
- **method name: drop**

In [19]:
## system does not know if X is a row or column, and by default assumes it is row, and there is no row with X
df.drop('X')
df

KeyError: "['X'] not found in axis"

df.drop()

- Column: which column you want to drop
- axis: it represents the specified value is a row or column
    - axis=0 means row
    - axis=1 means column
- inplace: will provide overwrite the dataframe or not
    - inplace = True, this indicates overwrite the dataframe
    - inplace = False, this indicates the modified dataframe will be use when you providenew variable for the operation

In [20]:
# by default inplace = False, which will create the new data frame, so exsiting df remains unchanged
df.drop('X',axis=1)
df

    X  X^2   X^3
0   2    1     1
1   4    4     8
2   6    9    27
3   8   16    64
4  10   25   125
5  12   36   216
6  14   49   343
7  16   64   512
8  18   81   729
9  20  100  1000

In [21]:
df.drop('X',axis=1,inplace=True)
df

   X^2   X^3
0    1     1
1    4     8
2    9    27
3   16    64
4   25   125
5   36   216
6   49   343
7   64   512
8   81   729
9  100  1000

In [ ]:
Step1: Create Dateframe
Step2: Provide the data
Step3: Provide the column names
Step4: Providing Index
Step5: Add a new column on existing data frame
Step6: Update the already existing column in the data frame
Step7: How to drop a column (axis, inplace)

In [ ]:
# We dont have anything to rename the exising column
# We need to add a new column and drop the existing column

**Step-8**

**Drop the row**

- drop the column and drop the tows both are similar only
- the only difference is axis value
    - axis = 0 represents rows (default value)
    - by default axis = 0 available
    - which means if you provide any values, it will represent tows only
    - no need to provide the axis

In [24]:
import pandas as pd

list1 = [x for x in range(1,11)]
list2 = [x**2 for x in range(1,11)]
list3 = [x**3 for x in range(1,11)]

df['X'] = list1
df['X^2'] = list2
df['X^3'] = list3
df

   X^2   X^3   X
0    1     1   1
1    4     8   2
2    9    27   3
3   16    64   4
4   25   125   5
5   36   216   6
6   49   343   7
7   64   512   8
8   81   729   9
9  100  1000  10

In [25]:
df.drop('X')
# if we run this we will get error
# by default  axis = 0 which represents
# but X is a column

KeyError: "['X'] not found in axis"

In [27]:
df.drop(4)
# if want to drop row, the provide the row index

   X^2   X^3   X
0    1     1   1
1    4     8   2
2    9    27   3
3   16    64   4
5   36   216   6
6   49   343   7
7   64   512   8
8   81   729   9
9  100  1000  10

In [29]:
# drop multiple rows
# multiple rows/columns keep always in a list
df.drop([2,5])

   X^2   X^3   X
0    1     1   1
1    4     8   2
3   16    64   4
4   25   125   5
6   49   343   7
7   64   512   8
8   81   729   9
9  100  1000  10

In [30]:
df
# previous data a wlll come as we have not given any inplace when dropping the rows

   X^2   X^3   X
0    1     1   1
1    4     8   2
2    9    27   3
3   16    64   4
4   25   125   5
5   36   216   6
6   49   343   7
7   64   512   8
8   81   729   9
9  100  1000  10

In [31]:
df.drop([0,1],axis=1)
# [0,1] index
# axis = 1 represents column
# error

KeyError: '[0, 1] not found in axis'

In [32]:
df.columns

Index(['X^2', 'X^3', 'X'], dtype='object')

In [33]:
df.columns[0]

'X^2'

In [34]:
df.columns[[0,1]]

Index(['X^2', 'X^3'], dtype='object')

**Step-9**

**How to select the column**

-

In [35]:
df['X']  
# Series type
# No column name display
# Whenever you see this type : Series type

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [36]:
df['X^2']

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
Name: X^2, dtype: int64

In [37]:
df[['X^2']]
# Dataframe

   X^2
0    1
1    4
2    9
3   16
4   25
5   36
6   49
7   64
8   81
9  100

In [38]:
type(df[['X^2']])

pandas.core.frame.DataFrame

In [39]:
type(df['X^2'])

pandas.core.series.Series

In [40]:
df.X^2

0     3
1     0
2     1
3     6
4     7
5     4
6     5
7    10
8    11
9     8
Name: X, dtype: int64

- df['X'] : Series type
- df.X : Series type
- df[[]'X']] : Dataframe type

In [41]:
df['X','X^2']

KeyError: ('X', 'X^2')

In [42]:
df[['X','X^2']]

    X  X^2
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [43]:
df['X'].values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

- All values comes in an array
- Array means it is a list of elements only represents using numpy package
- Generally elements present in 4 ways
    - List : Basic representation
    - Numpy array : Array with Numpy package representation
    - Tensors: Tensorflow package
    - Torch: Pytorch package

In [44]:
list1 = [1,2,3,4]
list1

[1, 2, 3, 4]

In [45]:
import numpy as np
np.array(list1)

array([1, 2, 3, 4])

In [46]:
# Take 2 lists
list1 = [1,2,3,4]
list2 = [10,20,30,40]
list1+list2

[1, 2, 3, 4, 10, 20, 30, 40]

In [47]:
l1 = np.array(list1)
l2 = np.array(list2)
l1+l2

array([11, 22, 33, 44])

In [49]:
df['X'].values
# imagine we worked on an ML problem
# we got some series of values
# with that series fo values also we can create a dataframe

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

In [50]:
df['Y'] = df['X'].values

In [51]:
df

   X^2   X^3   X   Y
0    1     1   1   1
1    4     8   2   2
2    9    27   3   3
3   16    64   4   4
4   25   125   5   5
5   36   216   6   6
6   49   343   7   7
7   64   512   8   8
8   81   729   9   9
9  100  1000  10  10

In [ ]:
Step1: Create Dateframe
Step2: Provide the data
Step3: Provide the column names
Step4: Providing Index
Step5: Add a new column on existing data frame
Step6: Update the already existing column in the data frame
Step7: How to drop a column (axis, inplace)
Step8: Drop a row
Step9: Select the column
Step10: Save the data frame
Step11: How to read a dataframe

**Step-10**

**Save the data frame**

- DataFrame we can save in two formats
    - csv: comma sepearated values
    - xlsx: excel format
- In order to save any data, we need three things
    - Where you want to save: directory name
    - what is the name of the file for storing
    - what is the extension

In [52]:
df.to_csv()

',X^2,X^3,X,Y\r\n0,1,1,1,1\r\n1,4,8,2,2\r\n2,9,27,3,3\r\n3,16,64,4,4\r\n4,25,125,5,5\r\n5,36,216,6,6\r\n6,49,343,7,7\r\n7,64,512,8,8\r\n8,81,729,9,9\r\n9,100,1000,10,10\r\n'

In [ ]:
# Case-1: Saving file at same locatioio
# No need to provide directory path
# Directyly give only nam eof the file and extension

In [54]:
df.to_csv('data1.csv')
df.to_excel('data1.xlsx')

**Step-11**

**How to read a dataframe**

In [56]:
import pandas as pd
pd.read_csv('data1.csv')

   Unnamed: 0  X^2   X^3   X   Y
0           0    1     1   1   1
1           1    4     8   2   2
2           2    9    27   3   3
3           3   16    64   4   4
4           4   25   125   5   5
5           5   36   216   6   6
6           6   49   343   7   7
7           7   64   512   8   8
8           8   81   729   9   9
9           9  100  1000  10  10

In [57]:
pd.read_excel('data1.xlsx')

   Unnamed: 0  X^2   X^3   X   Y
0           0    1     1   1   1
1           1    4     8   2   2
2           2    9    27   3   3
3           3   16    64   4   4
4           4   25   125   5   5
5           5   36   216   6   6
6           6   49   343   7   7
7           7   64   512   8   8
8           8   81   729   9   9
9           9  100  1000  10  10

**Step-12**

**How to avoid index column when saving DataFrame**

- while we save the dataframe
- automaticallya new column will create
- that we need to avoid
- If you get Permission denied error means, close the data file when doing operation on the file

In [59]:
df.to_csv('data2.csv', index=False)
df.to_excel('data2.xlsx', index=False)

In [60]:
import pandas as pd
pd.read_csv('data2.csv')

   X^2   X^3   X   Y
0    1     1   1   1
1    4     8   2   2
2    9    27   3   3
3   16    64   4   4
4   25   125   5   5
5   36   216   6   6
6   49   343   7   7
7   64   512   8   8
8   81   729   9   9
9  100  1000  10  10

In [61]:
pd.read_excel('data2.xlsx')

   X^2   X^3   X   Y
0    1     1   1   1
1    4     8   2   2
2    9    27   3   3
3   16    64   4   4
4   25   125   5   5
5   36   216   6   6
6   49   343   7   7
7   64   512   8   8
8   81   729   9   9
9  100  1000  10  10

In [1]:
a=10
b=20
c=a+b
print(c)

30